{
  "title": "Gluco Check",
  "status": {
    "general": {
      "loading": "Loading",
      "error": "Er liep iets mis"
    }
  },
  "landing": {
    "title": "Welkom bij Gluco Check",
    "introduction": {
      "p1": "Gluco Check brengt Nightscout naar je Google Assistant. Vraag dingen zoals:",
      "features1": "mijn suiker / bloedsuiker / glucose",
      "features2": "mijn insuline / insuline aan boord",
      "features3": "mijn koolhydraten / koolhydraten aan boord",
      "features4": "mijn pomp batterij / batterijniveau",
      "features5": "Hoe oud is mijn canule / infusieset? / Wanneer heb ik mijn infusieset / canule vervangen?",
      "features6": "Hoe oud is mijn sensor?",
      "features7": "Alles / alle waarden"
    }
  },
  "welcome": {
    "title": "Welkom bij Gluco Check",
    "content": "[Productinfo, more practical scenarios featuring ways to use it in your life in novel ways]."
  },
  "login": {
    "title": "Aanmelden"
  },
  "settings": {
    "title": "Instellingen",
    "content": "[Gluco Check works by talking to your Nightscout site. Enter details about your site below. Additional metrics (beyond current blood glucose) require a valid token.]",
    "form": {
      "validationInProgress": "[Checking your Nightscout site]",
      "labels": {
        "glucoseUnits": "Glucose Eenheden",
        "nightscoutToken": "Nightscout Token",
        "nightscoutUrl": "Nightscout URL",
        "defaultMetrics": "[Default Metrics]"
      },
      "helperText": {
        "nightscoutToken": {
          "default": "[Not sure how to get a token? Read on!]",
          "empty": "[A token is required to read additional metrics]",
          "invalid": "[Your Nightscout site is not accepting this token]"
        },
        "nightscoutUrl": {
          "default": "URL van je Nightscout site",
          "required": "[This field is required]",
          "notNightscout": "[This URL does not point to a Nightscout site]",
          "needsUpgrade": "[Your Nightscout site requires an update to work with Gluco Check, please update to at least {{version}}]"
        },
        "defaultMetrics": {
          "default": "[Assistant will read these items to you by default]",
          "required": "[You must select at least one metric]",
          "notAvailable": "[* We did not find a recent value for these metrics, but you can still select them]"
        },
        "glucoseUnits": {
          "mismatch": "[Chosen unit differs from your Nightscout site's units]"
        }
      },
      "submitButton": "Instellingen opslaan",
      "submitStatus": {
        "submitting": "Je instellingen worden opgeslagen",
        "submitted": "Je instellingen zijn opgeslagen",
        "error": "Er liep iets mis bij het opslaan van je instellingen"
      }
    }
  },
  "navigation": {
    "home": "Home",
    "login": "Aanmelden",
    "logout": "Afmelden",
    "settings": "Instellingen"
  },
  "diabetesMetrics": {
    "Everything": "[everything]",
    "BloodSugar": "[blood sugar]",
    "InsulinOnBoard": "[insulin on board]",
    "CarbsOnBoard": "[carbs on board]",
    "SensorAge": "[sensor age]",
    "CannulaAge": "[cannula age]",
    "PumpBattery": "[pump battery]"
  },
  "tokenDialog": {
    "title": "[Generating a Nightscout token]",
    "preamble": "[For basic features like checking your numbers, your Nightscout url is enough. For more advanced features, you're going to need a token with full api read permissions. If you don't know what that means, don't sweat it! We'll go through it one step at a time.]",
    "links": {
      "howToUpdateNightscout": "http://www.nightscout.info/wiki/faqs-2/azure/updating-your-website-to-the-latest-release-pull-request",
      "glucoCheckSettings": "/settings"
    },
    "step1": {
      "label": "[Check Nightscout Version]",
      "description": "[First, make sure your site is on at least version 14 of Nightscout. You can check the version here by clicking on the hamburger menu button and looking here:]",
      "image": "nightscout-version.png",
      "image_alt": ""
    },
    "step2": {
      "label": "[Update Nightscout]",
      "description": "[If you do need an upgrade, you can read more about how to do that <2>here</2>. If not, let's make that token!]"
    },
    "step3": {
      "label": "[Create Role and Subject]",
      "description": "[Click on the hamburger menu, then \"Admin Tools\".]"
    },
    "step4": {
      "description": "[Click on \"Add new Role\", populate the Role with the values pictured below, and click save.]",
      "image": "edit-role.png",
      "image_alt": ""
    },
    "step5": {
      "description": "[Click on \"Add new Subject\", populate the Subject with the values pictured below, and click save.]",
      "image": "edit-subject.png",
      "image_alt": ""
    },
    "step6": {
      "description": "[Copy the value in the \"Access Token\" column, paste it into the Nightscout Token field in <2>Gluco Check Settings</2>, and click save.]",
      "image": "copy-token.png",
      "image_alt": ""
    }
  },
  "termsOfService": {
    "title": "Licentie en gebruiksvoorwaarden",
    "subtitle": "MIT License: Copyright {{currentYear}} Niels Maerten",
    "p1": "Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:",
    "p2": "The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.",
    "p3": "THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
  },
  "medicalDisclaimer": {
    "title": "Disclaimer i.v.m. medische informatie",
    "p1": "De informatie die Gluco Check verstrekt is geen vervanging voor het advies van een arts. Heb je vragen over je behandeling of advies nodig, praat dan met je dokter!"
  },
  "privacyPolicy": {
    "title": "Privacybeleid",
    "intro": "Dit document beschrijft de informatie die wordt verzameld door Gluco Check, [final URL] (de \"Service\" of de \"Software\") en hoe deze informatie wordt gebruikt.",
    "p1": {
      "title": "Welke informatie wordt verzameld?",
      "body": "De Service heeft 2 dingen nodig om te werken: het email adres van je Google Account (zodat we weten dat jij het bent wanneer je een opdracht geeft), en de URL van je Nightscout site (zodat we je glucose kunnen opzoeken en voorlezen)."
    },
    "p2": {
      "title": "Hoe wordt deze informatie gebruikt?",
      "body": "Wanneer je de Service oproept via Google Assistant (bv door te zeggen: 'Hey Google, praat met Gluco Check'), kijken we naar je email adres, en controleren we of hier een Nightscout site mee verbonden is. Zo ja, dan lezen we de huidige glucosewaarde voor van je Nightscout site."
    },
    "p3": {
      "title": "Delen van informatie",
      "body": "Je email adres of Nightscout URL zullen <strong>nooit</strong> gedeeld worden met een derde partij. Ik heb dit enkel nodig zodat ik weet welke Nightscout site ik moet checken wanneer je de Actie aanroept. Data uit je Nightscout site wordt niet bewaard, zelfs niet in logs."
    },
    "p4": {
      "title": "Je gegevens verwijderen",
      "body": "Je kan toegang op elk moment weer intrekken: Log gewoon in, verwijder je Nightscout URL, en klik op Opslaan. Je kan Gluco Check ook verwijderen uit je <2>Google account</2>."
    },
    "p5": {
      "title": "Analytics Cookie",
      "body": "Nadat je bent ingelogd op deze site, worden enkele anonieme statistieken over je bezoek verzameld met behulp van een cookie (Google Analytics). De cookie is niet actief tot je deze privacyovereenkomst hebt aanvaard. Ik gebruik Analytics om beter te begrijpen hoe mijn site gebruikt wordt, hoe bezoekers hem vinden, en uit welke demografie ze komen. Dit is enkel van toepassing op [this website], niet op het gebruik van de Assistant Actie zelf. Als je liever geen gebruik maakt van de Google Analytics cookie, kan je deze uitschakelen door <4>https://tools.google.com/dlpage/gaoptout/</4> te bezoeken."
    }
  }
}
