{
  "title": "Gluco Check",
  "status": {
    "general": {
      "loading": "Loading",
      "error": "Something has gone horribly wrong"
    }
  },
  "landing": {
    "title": "Welcome to Gluco Check",
    "introduction": {
      "p1": "Gluco Check brings Nightscout to your Google Assistant. Ask it things like",
      "features1": "my blood sugar / my BG / my glucose",
      "features2": "my insulin on board / IOB / insulin",
      "features3": "my carbs on board / COB / carbs",
      "features4": "pump battery",
      "features5": "How old is my cannula / When did I insert my cannula?",
      "features6": "What's the sensor's age?",
      "features7": "Everything / all values"
    }
  },
  "welcome": {
    "title": "Welcome to Gluco Check",
    "content": "Content about the product, more practical scenarios featuring ways to use it in your life in novel ways."
  },
  "login": {
    "title": "Login"
  },
  "settings": {
    "title": "Edit Settings",
    "content": "Gluco Check works by talking to your Nightscout site. Enter details about your site below. Additional metrics (beyond current blood glucose) require a valid token.",
    "form": {
      "validationInProgress": "Checking your Nightscout site",
      "labels": {
        "glucoseUnits": "Glucose Units",
        "nightscoutToken": "Nightscout Token",
        "nightscoutUrl": "Nightscout URL",
        "defaultMetrics": "Default Metrics"
      },
      "helperText": {
        "nightscoutToken": {
          "default": "Not sure how to get a token? Read on!",
          "empty": "A token is required to read additional metrics",
          "invalid": "Your Nightscout site is not accepting this token"
        },
        "nightscoutUrl": {
          "default": "URL of your Nightscout site",
          "required": "This field is required",
          "notNightscout": "This URL does not point to a Nightscout site",
          "needsUpgrade": "Your Nightscout site requires an update to work with Gluco Check, please update to at least {{version}}"
        },
        "defaultMetrics": {
          "default": "Assistant will read these items to you by default",
          "required": "You must select at least one metric",
          "notAvailable": "* We did not find a recent value for these metrics, but you can still select them"
        },
        "glucoseUnits": {
          "mismatch": "Chosen unit differs from your Nightscout site's units"
        }
      },
      "submitButton": "Save Settings",
      "submitStatus": {
        "submitting": "Saving your settings",
        "submitted": "Saved your settings",
        "error": "Something has gone horribly wrong saving your settings"
      }
    }
  },
  "navigation": {
    "home": "Home",
    "login": "Login",
    "logout": "Logout",
    "settings": "Settings"
  },
  "diabetesMetrics": {
    "Everything": "everything",
    "BloodSugar": "blood sugar",
    "InsulinOnBoard": "insulin on board",
    "CarbsOnBoard": "carbs on board",
    "SensorAge": "sensor age",
    "CannulaAge": "cannula age",
    "PumpBattery": "pump battery"
  },
  "tokenDialog": {
    "title": "Generating a Nightscout token",
    "preamble": "For basic features like checking your numbers, your Nightscout url is enough. For more advanced features, you're going to need a token with full api read permissions. If you don't know what that means, don't sweat it! We'll go through it one step at a time.",
    "links": {
      "howToUpdateNightscout": "http://www.nightscout.info/wiki/faqs-2/azure/updating-your-website-to-the-latest-release-pull-request",
      "glucoCheckSettings": "/settings"
    },
    "step1": {
      "label": "Check Nightscout Version",
      "description": "First, make sure your site is on at least version 14 of Nightscout. You can check the version here by clicking on the hamburger menu button and looking here:",
      "image": "nightscout-version.png",
      "image_alt": ""
    },
    "step2": {
      "label": "Update Nightscout",
      "description": "If you do need an upgrade, you can read more about how to do that <2>here</2>. If not, let's make that token!"
    },
    "step3": {
      "label": "Create Role and Subject",
      "description": "Click on the hamburger menu, then \"Admin Tools\"."
    },
    "step4": {
      "description": "Click on \"Add new Role\", populate the Role with the values pictured below, and click save.",
      "image": "edit-role.png",
      "image_alt": ""
    },
    "step5": {
      "description": "Click on \"Add new Subject\", populate the Subject with the values pictured below, and click save.",
      "image": "edit-subject.png",
      "image_alt": ""
    },
    "step6": {
      "description": "Copy the value in the \"Access Token\" column, paste it into the Nightscout Token field in <2>Gluco-Check Settings</2>, and click save.",
      "image": "copy-token.png",
      "image_alt": ""
    }
  },
  "termsOfService": {
    "title": "License and Terms of service",
    "subtitle": "MIT License: Copyright {{currentYear}} Niels Maerten",
    "p1": "Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:",
    "p2": "The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.",
    "p3": "THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
  },
  "medicalDisclaimer": {
    "title": "Healthcare information disclaimer",
    "p1": "The information provided by Nightscout Status is not a substitute for advice from a medical professional. If you have questions about treatment or need advice, remember to always ask your doctor!"
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "intro": "This document describes the information being collected by Nightscout Status, https://nielsmaerten.github.io/nightscout-assistant (the \"Service\" or the \"Software\") and how this information is used.",
    "p1": {
      "title": "What information is collected?",
      "body": "The Service needs 2 things in order to work: the email address of your Google Account (so it can know it's you when you make a request), and the URL of your Nightscout instance (so it can look up your glucose and read it to you)."
    },
    "p2": {
      "title": "How is this information used?",
      "body": "When you invoke the Service through Google Assistant (i.e.: by saying: 'Hey Google, talk to Nightscout Status), the Service looks at your email address, and checks if there's a Nightscout site associated with it. If so, your current glucose level is read from your Nightscout site."
    },
    "p3": {
      "title": "Sharing of information",
      "body": "Your email address or Nightscout URL will **never** be shared with a third party. I just need it so I know which Nightscout site to check when you invoke the Action. Data from your Nightscout website is not saved, not even to log files."
    },
    "p4": {
      "title": "Deleting your data",
      "body": "You can choose to revoke access at any time: Simply via log in, remove your Nightscout URL, and click Save. You can also remove Nightscout Status from your Google Account."
    },
    "p5": {
      "title": "Analytics Cookie",
      "body": "After you sign in to this site, some anonymous statistics about your visit are collected using a cookie (Google Analytics). The cookie is not enabled until after you've accepted this Privacy Policy. I'm using Analytics to better understand how people are using this site, how they found it, and which demographic they're in. This only applies to <2>https://nielsmaerten.github.io/nightscout-assistant</2>, not to usage of the Assistant Action itself. If you'd like to opt-out of the Google Analytics cookie, you can do so by visiting <4>https://tools.google.com/dlpage/gaoptout/</4>"
    }
  }
}
